"# Meterr.ai 5-Minute Demo Script\n\n## [0:00-0:30] The Hook\n\n**[Screen: Black screen with white text appearing]**\n\n\"Last month, a 50-person startup discovered they were burning $18,000 on AI tools they didn't even know about.\"\n\n**[Fade to presenter with dashboard in background]**\n\n\"Hey everyone. Quick question - how much did your team spend on ChatGPT, Claude, and other AI tools... yesterday? If you don't know the exact number, you're not alone. The average company is overspending on AI by 40% without realizing it.\n\nI'm about to show you how to fix that in literally 2 minutes.\"\n\n---\n\n## [0:30-1:30] The Problem Made Real\n\n**[Screen: Live Meterr dashboard showing real numbers]**\n\n\"This is Sarah's dashboard. She runs a 30-person marketing agency. Look at this - *[hover over graph]* - last Tuesday at 2 PM, her costs spiked to $847 in one hour. One. Hour.\n\nTurns out, an intern was using GPT-4 to generate 500 product descriptions... one at a time. Each costing $3. Nobody knew until the monthly bill arrived.\n\n*[Click on team breakdown]* \n\nSee this? Three people are responsible for 78% of their AI spend. But here's the kicker - two of them didn't even realize they were using the expensive models.\"\n\n---\n\n## [1:30-2:30] The Magic Moment\n\n**[Screen: Switch to Chrome browser]**\n\n\"Now watch this. Installing Meterr takes exactly... *[start timer on phone]* ...let's see.\n\n*[Click Chrome Web Store]* \n*[Click 'Add to Chrome']* \n*[Extension appears in toolbar]*\n\n17 seconds. Done. No API keys. No configuration. No IT department needed.\n\n*[Navigate to ChatGPT]*\n\nNow when I use ChatGPT... *[type a prompt]* ...see that little counter? That prompt just cost 14 cents. This response? Another 31 cents. \n\nYour team sees this every. single. time. It's like having a taxi meter for AI.\"\n\n---\n\n## [2:30-3:30] The Transformation\n\n**[Screen: Split screen - Before/After dashboard]**\n\n\"Here's what happened to Sarah's company. \n\n**Before Meterr:** $24,000 per month, climbing 30% monthly, no idea why.\n\n**After two weeks:** Already down to $19,000. How?\n- Switched 60% of routine tasks to GPT-3.5 - same results, 90% cheaper\n- Caught duplicate subscriptions - three people paying for ChatGPT Plus individually\n- Set up alerts - now they get notified BEFORE hitting daily limits\n\n*[Click on alert notification]*\n\nLook - this alert saved them $2,000 last week alone. 'Unusual spending detected: Marketing team exceeded normal usage by 300%.' Turns out someone left a script running overnight.\"\n\n---\n\n## [3:30-4:30] The Human Impact\n\n**[Screen: Team usage breakdown with profile pictures]**\n\n\"But here's my favorite part. This isn't about restricting your team - it's about empowering them.\n\n*[Click on team member profile]*\n\nMeet Jake, their content lead. He thought he was being efficient using GPT-4 for everything. We showed him that switching to Claude for long documents would save $400/month with better results. \n\nNow he's the AI optimization champion in their Slack. People actually compete to find savings. It's gamified cost control.\n\n*[Show export screen]*\n\nAnd for finance? One click. Full expense report. CSV, PDF, whatever you need. Your CFO will love you.\"\n\n---\n\n## [4:30-5:00] The Close\n\n**[Screen: Simple pricing page]**\n\n\"Look, you have two choices:\n\nKeep flying blind and find out next month that you've burned another $20,000 on AI.\n\nOr start your free trial right now. No credit card. Install the extension, and in 60 seconds you'll see exactly what you're spending.\n\nOur pricing? Dead simple:\n- **Free forever** for individuals\n- **$29/user** for teams who want to save thousands\n\nMost customers save 10x their subscription cost in the first week.\n\n*[Screen: Big button - \"Start Free Trial\"]*\n\nClick this button. Install the extension. And never get surprised by an AI bill again.\n\nQuestions? I'm here live for the next 5 minutes, or book a call with me at meterr.ai/demo.\n\nWho's ready to take control of their AI spending?\"\n\n---\n\n**[Demo Notes for Presenter:]**\n- Keep energy high but conversational\n- Use real numbers whenever possible\n- Pause after big reveals for impact\n- Always relate features back to money saved\n- End with urgency but not pressure"
